## :white_check_mark: terraform/aws/palserver:  tfmigrate apply

[Build link](https://github.com/boxp/arch/actions/runs/8270590749)

```
$ tfmigrate apply
```

<details>


```
time="2024-03-13T19:40:08Z" level=info msg="download and unarchive the package" aqua_version=2.24.0 env=linux/amd64 exe_name=tfmigrate package_name=minamijoyo/tfmigrate package_version=v0.3.18 program=aqua registry=standard
2024/03/13 19:40:08 [INFO] AWS Auth provider used: "EnvProvider"
2024/03/13 19:40:09 [INFO] [runner] unapplied migration files: [20240313193138_import_ecr.hcl]
2024/03/13 19:40:09 [INFO] [runner] load migration file: tfmigrate/20240313193138_import_ecr.hcl
2024/03/13 19:40:09 [INFO] [migrator] start state migrator plan phase for apply
2024/03/13 19:40:09 [INFO] [migrator@.] terraform version: 1.6.2
2024/03/13 19:40:09 [INFO] [migrator@.] initialize work dir
2024/03/13 19:40:12 [INFO] [migrator@.] get the current remote state
2024/03/13 19:40:14 [INFO] [migrator@.] override backend to local
2024/03/13 19:40:14 [INFO] [executor@.] create an override file
2024/03/13 19:40:14 [INFO] [migrator@.] creating local workspace folder in: terraform.tfstate.d/default
2024/03/13 19:40:14 [INFO] [executor@.] switch backend to local
2024/03/13 19:40:15 [INFO] [migrator@.] compute a new state
2024/03/13 19:40:18 [INFO] [migrator@.] check diffs
2024/03/13 19:40:22 [INFO] [migrator@.] unexpected diffs, ignoring as force option is true: failed to run command (exited 2): terraform plan -state=/tmp/tmp134795725 -out=/tmp/tfplan1751378665 -input=false -no-color -detailed-exitcode
stdout:
aws_kms_key.ecr_kms: Refreshing state... [id=a2bcaab0-22fe-484a-90c3-9941aaf47047]
aws_ecr_repository.palserver: Refreshing state... [id=palserver]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.palserver must be replaced
-/+ resource "aws_ecr_repository" "palserver" {
      ~ arn                  = "arn:aws:ecr:ap-northeast-1:839695154978:repository/palserver" -> (known after apply)
      ~ id                   = "palserver" -> (known after apply)
        name                 = "palserver"
      ~ registry_id          = "839695154978" -> (known after apply)
      ~ repository_url       = "839695154978.dkr.ecr.ap-northeast-1.amazonaws.com/palserver" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ encryption_configuration {
          ~ kms_key         = "arn:aws:kms:ap-northeast-1:839695154978:key/cacbd589-6f57-4ee1-bbb2-9230d4411a7f" -> "a2bcaab0-22fe-484a-90c3-9941aaf47047" # forces replacement
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan1751378665

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan1751378665"

stderr:
2024/03/13 19:40:22 [INFO] [executor@.] remove the override file
2024/03/13 19:40:22 [INFO] [executor@.] remove the workspace state folder
2024/03/13 19:40:22 [INFO] [executor@.] switch back to remote
2024/03/13 19:40:25 [INFO] [migrator] start state migrator apply phase
2024/03/13 19:40:25 [INFO] [migrator] push the new state to remote
2024/03/13 19:40:28 [INFO] [migrator] state migrator apply success!
2024/03/13 19:40:28 [INFO] [runner] add a record to history: 20240313193138_import_ecr.hcl
2024/03/13 19:40:28 [INFO] [runner] save history
2024/03/13 19:40:28 [INFO] AWS Auth provider used: "EnvProvider"
2024/03/13 19:40:29 [INFO] [runner] history saved

```


</details>

<!-- github-comment: {"JobName":"apply","SHA1":"9d6f05d0977e4c76551895a8c584684ec3e0380c","TemplateKey":"tfmigrate-apply","Vars":{},"WorkflowName":"apply"} -->